УТ_для_edt/src/ExchangePlans/смартОбменСоСкладомАтлант/смартОбменСоСкладомАтлант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="02fb43b5-8949-4bce-a2cf-51b86de2c64d">
  <name>смартОбменСоСкладомАтлант</name>
  <comment>#Б-2746 смарт: Лопато 31.03.2025 //Интеграция с WMS. Атлант. Выгрузка номенклатуры</comment>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйКонтур</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPАдрес</name>
    <comment>#Б-2520 смарт: Лопато 03.03.2025 //Интеграция с WMS. Атлант. Подготовительные работы. Настройки, метаданные, модули. Настройка подключения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPЛогин</name>
    <comment>#Б-2520 смарт: Лопато 03.03.2025 //Интеграция с WMS. Атлант. Подготовительные работы. Настройки, метаданные, модули. Настройка подключения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPПароль</name>
    <comment>#Б-2520 смарт: Лопато 03.03.2025 //Интеграция с WMS. Атлант. Подготовительные работы. Настройки, метаданные, модули. Настройка подключения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АтлантFTPНастройкиОтбораНоменклатуры</name>
    <comment>#Б-2746 смарт: Лопато 31.03.2025 //Интеграция с WMS. Атлант. Выгрузка номенклатуры</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

УТ_для_edt/src/ExchangePlans/смартОбменСоСкладомАтлант/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ПустаяСтрока(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	
	НайденныйУзел = ПланыОбмена.смартОбменСоСкладомАтлант.НайтиПоНаименованию(Наименование);
	
	Если ЗначениеЗаполнено(НайденныйУзел) 
		И НайденныйУзел.Ссылка <> ЭтотОбъект.Ссылка Тогда
		
		Сообщить("Уже существует такое наименование настройки обмена. Укажите новое наименование");
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если НЕ ИспользоватьРегламентныеЗадания Тогда
		
		УдалитьРегламентноеЗадание();
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	УдалитьРегламентноеЗадание();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	ТестовыйКонтур = Ложь;
	ИдентификаторРегламентногоЗадания = НеОпределено;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРегламентноеЗадание() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Задание;
	
КонецФункции

Процедура УдалитьРегламентноеЗадание() Экспорт

	Задание = ПолучитьРегламентноеЗадание();

	Если НЕ Задание = Неопределено Тогда

		УстановитьПривилегированныйРежим(Истина);

		Задание.Удалить();

		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
